import React from 'react';
import { AccordionItem } from './AccordionItem';
import './accordion.css'; 

export const Accordion = () => {
  return (
    <section className="questions section">
      <div className="container section__inner">
        <div className="section__descr">
          <h2 className="title">Часті запитання</h2>
        </div>
        <div className="questions__content">
          <div className="accordion">
            <AccordionItem title="Які запахи доступні для свічок?">
              <ol>
                <li>Ваніль - теплий, сладкий і затишний аромат, який нагадує про домашній затишок.</li>
                <li>Лаванда - приємний, успокійливий і релаксуючий запах, який допомагає зняти стрес і напругу.</li>
                <li>Рожевий грейпфрут - свіжий, фруктовий і енергійний аромат, який допомагає підняти настрій і збадьорити.</li>
                <li>Кедр - деревний, земний і маскулінний аромат, який надає відчуття стабільності і надійності.</li>
                <li>Яблуко і кориця - теплий і затишний аромат, який нагадує про зимові свята і домашність.</li>
              </ol>
            </AccordionItem>
            <AccordionItem title="Як довго горять свічки?">
            <ol>
                <li>Ваніль - теплий, сладкий і затишний аромат, який нагадує про домашній затишок.</li>
                <li>Лаванда - приємний, успокійливий і релаксуючий запах, який допомагає зняти стрес і напругу.</li>
                <li>Рожевий грейпфрут - свіжий, фруктовий і енергійний аромат, який допомагає підняти настрій і збадьорити.</li>
                <li>Кедр - деревний, земний і маскулінний аромат, який надає відчуття стабільності і надійності.</li>
                <li>Яблуко і кориця - теплий і затишний аромат, який нагадує про зимові свята і домашність.</li>
              </ol>
            </AccordionItem>
            <AccordionItem title="Чи можна зробити замовлення на індивідуальний дизайн свічки?">
            <ol>
                <li>Ваніль - теплий, сладкий і затишний аромат, який нагадує про домашній затишок.</li>
                <li>Лаванда - приємний, успокійливий і релаксуючий запах, який допомагає зняти стрес і напругу.</li>
                <li>Рожевий грейпфрут - свіжий, фруктовий і енергійний аромат, який допомагає підняти настрій і збадьорити.</li>
                <li>Кедр - деревний, земний і маскулінний аромат, який надає відчуття стабільності і надійності.</li>
                <li>Яблуко і кориця - теплий і затишний аромат, який нагадує про зимові свята і домашність.</li>
              </ol>
            </AccordionItem>
            <AccordionItem title="Які є варіанти доставки?">
            <ol>
                <li>Ваніль - теплий, сладкий і затишний аромат, який нагадує про домашній затишок.</li>
                <li>Лаванда - приємний, успокійливий і релаксуючий запах, який допомагає зняти стрес і напругу.</li>
                <li>Рожевий грейпфрут - свіжий, фруктовий і енергійний аромат, який допомагає підняти настрій і збадьорити.</li>
                <li>Кедр - деревний, земний і маскулінний аромат, який надає відчуття стабільності і надійності.</li>
                <li>Яблуко і кориця - теплий і затишний аромат, який нагадує про зимові свята і домашність.</li>
              </ol>
            </AccordionItem>
            <AccordionItem title="Як оплачувати замовлення?">
            <ol>
                <li>Ваніль - теплий, сладкий і затишний аромат, який нагадує про домашній затишок.</li>
                <li>Лаванда - приємний, успокійливий і релаксуючий запах, який допомагає зняти стрес і напругу.</li>
                <li>Рожевий грейпфрут - свіжий, фруктовий і енергійний аромат, який допомагає підняти настрій і збадьорити.</li>
                <li>Кедр - деревний, земний і маскулінний аромат, який надає відчуття стабільності і надійності.</li>
                <li>Яблуко і кориця - теплий і затишний аромат, який нагадує про зимові свята і домашність.</li>
              </ol>
            </AccordionItem>
            <AccordionItem title="Як довго триває курс?">
            <ol>
                <li>Ваніль - теплий, сладкий і затишний аромат, який нагадує про домашній затишок.</li>
                <li>Лаванда - приємний, успокійливий і релаксуючий запах, який допомагає зняти стрес і напругу.</li>
                <li>Рожевий грейпфрут - свіжий, фруктовий і енергійний аромат, який допомагає підняти настрій і збадьорити.</li>
                <li>Кедр - деревний, земний і маскулінний аромат, який надає відчуття стабільності і надійності.</li>
                <li>Яблуко і кориця - теплий і затишний аромат, який нагадує про зимові свята і домашність.</li>
              </ol>
            </AccordionItem>
            <AccordionItem title="Чи є сертифікат на курс?">
            <ol>
                <li>Ваніль - теплий, сладкий і затишний аромат, який нагадує про домашній затишок.</li>
                <li>Лаванда - приємний, успокійливий і релаксуючий запах, який допомагає зняти стрес і напругу.</li>
                <li>Рожевий грейпфрут - свіжий, фруктовий і енергійний аромат, який допомагає підняти настрій і збадьорити.</li>
                <li>Кедр - деревний, земний і маскулінний аромат, який надає відчуття стабільності і надійності.</li>
                <li>Яблуко і кориця - теплий і затишний аромат, який нагадує про зимові свята і домашність.</li>
              </ol>
            </AccordionItem>
          </div>
        </div>
      </div>
    </section>
  );
};

